---
kind: enumMember
id: F:Autodesk.Revit.DB.TextAlignMask.vertAlignMask
enum: Autodesk.Revit.DB.TextAlignMask
source: html/16629583-3496-1617-f384-5ce49ce93134.htm
---
# Autodesk.Revit.DB.TextAlignMask.vertAlignMask

The mask of the Text object being aligned in the vertical direction.